class MainText:

    main_window: str = """Это главное меню бота. Отсюда ты можешь попасть в следующие разделы:

- Объявления. Здесь можно создавать свои объявления и искать чужие.

- Профиль. В нем можно посмотреть свои созданные и избранные объявления.

- Правила. Все просто - нажав на эту кнопку, можно освежить в голове правила пользования ботом."""

    ads_window: str = """Выбери, пожалуйста, нужное и нажми на одну из кнопок ниже:

- Создать. С помощью этой кнопки ты можешь создать свое объявление.

- Найти. С помощью этой кнопки ты можешь найти чужое объявление."""

    profile_window: str = """Выбери, пожалуйста, нужное и нажми на одну из кнопок ниже"""

    user_ads_window: str = """Выбери, пожалуйста, нужное и нажми на одну из кнопок ниже:

- Созданные. Здесь отображаются все созданные тобой объявления

- Избанные. Здесь отображаются все объявления, которые ты добавлял в избранные"""
