class OnboardingText:

    no_username: str = (
        """Отмечу, что у тебя нет имени пользователя, поэтому тебе придется \
писать его вручную каждый раз при создании объявления. \
Если не хочешь этим заниматься - создай его в Настройках, \
затем вернись сюда и нажми /start"""

    )

    first_message: str = (

        """Привет! Этот бот помогает людям прощаться с ненужными таблетками и искать нужные.

Прежде чем начать им пользоваться, внимательно ознакомься с правилами, ведь \
если ты нарушишь их, улетишь в мут или бан, поскольку все анкеты проходят модерацию.

Но даже если модераторы что-то пропустят, то помни, что тебя всегда могут зарепортить \
добропорядочные пользователи. Поэтому будь добр, читай внимательно, пользуйся ботом с умом \
и НИ В КОЕМ СЛУЧАЕ не пытайся купить/продать таблетки здесь.

        """

    )

    rules_one: str = (
        """1. Все лекарственные препараты, как для людей, так и для животных \
здесь отдают и ищут БЕСПЛАТНО и БЕЗВОЗМЕЗДНО. ПРОДАЖИ, ПОКУПКИ, ОБМЕНА НЕТ.

Дело в том, что продажа медикаментов с рук запрещена федеральным законом от 12
апреля 2010 г N 61-Ф3 - <a href="http://www.consultant.ru/document \
/cons_doc_LAW_34661/833f2cbf385d3510c03ee8509c84e47d2c69f7eb/"> \
Об обращении лекарственных cредств" </a> и наказывается штрафом.

Если вы наткнулись на объявление, в котором предлагают КУПИТЬ, ПРОДАТЬ или ОБМЕНЯТЬ лекарственные препараты, изделия медицинского назначения, препараты из списков ПККН, просьба обязательно зарепортить его

2. Категорически запрещены объявления об отдаче и поиске препаратов из следующих списков:
2.1 <a href="https://www.garant.ru/products/ipo/prime/doc/12049060/#1000"> Список сильнодействующих веществ </a>
2.2 <a href="https://www.garant.ru/products/ipo/prime/doc/12049060/#2000"> Список ядовитых веществ </a>
2.3 <a href="https://base.garant.ru/12112176/#friends"> Список наркотических и психотропных веществ </a>

Их оборот контролируется ПККН и влечет уголовную ответственность

3. <a href="https://www.consultant.ru/document/cons_doc_LAW_10699/cebb2f9c5c520486a7d067489f5ef2c33ebfce83/">Поиск и отдача</a> рецептов запрещены

4. Запрещено размещение любых объявлений, которые напрямую не касаются тематики данного проекта

"""
    )

    rules_two: str = (
        """ВАЖНО:

1. В проекте мы (создатели бота и модераторы) выполняем роль посредников, не преследуем коммерческих интересов и действуем исключительно с целью дать препаратам второй шанс.

2. Если соглашаетесь на пересылку, вы действуете на свое усмотрение. Создатели бота и модерация не несет ответственности за не полученный или некачественный препарат.

3. Если вы отдаете рецептурный препарат, убедитесь, что он назначен врачом:
3.1 Есть новый или просроченный рецепт
3.2 Есть переписка с врачом по поводу назначения этого препарата

4. Забирая рецептурный препарат, будьте готовы к тому, что у вас могут потребовать рецепт.

5. Забирая препараты, вы действуете на своё усмотрение, и ответственность за ваше здоровье лежит только на вас. Когда забираете препарат, уточняйте условия, в которых его хранили.


Напоминаем о важности грамотного потребления и личной экологической ответственности уже на этапе приобретения. Откажитесь от неразумных покупок!
        """
    )
